![rmotr](https://user-images.githubusercontent.com/7065401/39119486-4718e386-46ec-11e8-9fc3-5250a49ef570.png)
<hr style="margin-bottom: 40px;">

<img src="https://user-images.githubusercontent.com/872296/38710484-1b94f93c-3e97-11e8-977c-abde2e774f57.png"
    style="width:300px; float: right; margin: 0 40px 40px 40px;"></img>

# Aggregation and Grouping

![separator2](https://user-images.githubusercontent.com/7065401/39119518-59fa51ce-46ec-11e8-8503-5f8136558f2b.png)

## Hands on!

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [4]:
players = pd.DataFrame({
    'salary': [
        33285709,
        31269231,
        34682550,
        25000000,
        17826150,
        29512900,
        28530608,
        26243760,
        18868625,
        2500000
    ],
    'season_start': [
        2017, 2017, 2017, 2017, 2017, 2017, 2017, 2017, 2017, 2017
    ],
    'season_end': [2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018],
    'team': [
        'CLE',
        'DEN',
        'GSW',
        'GSW',
        'GSW',
        'LAC',
        'OKC',
        'OKC',
        'SAS',
        'SAS'
    ],
    'Pos': [
        'SF', 'PF', 'PG', 'PF', 'SG', 'PF', 'PG', 'SF', 'SF', 'SG'
    ],
    'Age': [32.0, 31.0, 28.0, 28.0, 26.0, 27.0, 28.0, 32.0, 25.0, 39.0]
}, index=[
    'LeBron James',
    'Paul Millsap',
    'Stephen Curry',
    'Kevin Durant',
    'Klay Thompson',
    'Blake Griffin',
    'Russell Westbrook',
    'Carmelo Anthony',
    'Kawhi Leonard',
    'Manu Ginobili'
])

In [5]:
players.sort_index(inplace=True)

In [6]:
players

                    Age Pos    salary  season_end  season_start team
Blake Griffin      27.0  PF  29512900        2018          2017  LAC
Carmelo Anthony    32.0  SF  26243760        2018          2017  OKC
Kawhi Leonard      25.0  SF  18868625        2018          2017  SAS
Kevin Durant       28.0  PF  25000000        2018          2017  GSW
Klay Thompson      26.0  SG  17826150        2018          2017  GSW
LeBron James       32.0  SF  33285709        2018          2017  CLE
Manu Ginobili      39.0  SG   2500000        2018          2017  SAS
Paul Millsap       31.0  PF  31269231        2018          2017  DEN
Russell Westbrook  28.0  PG  28530608        2018          2017  OKC
Stephen Curry      28.0  PG  34682550        2018          2017  GSW

In [7]:
players.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Blake Griffin to Stephen Curry
Data columns (total 6 columns):
Age             10 non-null float64
Pos             10 non-null object
salary          10 non-null int64
season_end      10 non-null int64
season_start    10 non-null int64
team            10 non-null object
dtypes: float64(1), int64(3), object(2)
memory usage: 560.0+ bytes

![separator1](https://user-images.githubusercontent.com/7065401/39119545-6d73d9aa-46ec-11e8-98d3-40204614f000.png)

## Understanding Grouping

We can manually simulate the Split > Apply > Combine operation.

##### 1. Split (split players by positions)

In [11]:
players['Pos'].value_counts()

PF    3
SF    3
SG    2
PG    2
Name: Pos, dtype: int64

**Position = 'PF'**

In [12]:
players[players['Pos'] == 'PF']

                Age Pos    salary  season_end  season_start team
Blake Griffin  27.0  PF  29512900        2018          2017  LAC
Kevin Durant   28.0  PF  25000000        2018          2017  GSW
Paul Millsap   31.0  PF  31269231        2018          2017  DEN

**Position = 'SF'**

In [13]:
players[players['Pos'] == 'SF']

                  Age Pos    salary  season_end  season_start team
Carmelo Anthony  32.0  SF  26243760        2018          2017  OKC
Kawhi Leonard    25.0  SF  18868625        2018          2017  SAS
LeBron James     32.0  SF  33285709        2018          2017  CLE

**Position = 'PG'**

In [14]:
players[players['Pos'] == 'PG']

                    Age Pos    salary  season_end  season_start team
Russell Westbrook  28.0  PG  28530608        2018          2017  OKC
Stephen Curry      28.0  PG  34682550        2018          2017  GSW

##### 2. Apply (apply a function to each group)

For example, get the `max` salary per group (per position):

In [15]:
players[players['Pos'] == 'PF'].sort_values(by='salary', ascending=False)

                Age Pos    salary  season_end  season_start team
Paul Millsap   31.0  PF  31269231        2018          2017  DEN
Blake Griffin  27.0  PF  29512900        2018          2017  LAC
Kevin Durant   28.0  PF  25000000        2018          2017  GSW

In [16]:
players[players['Pos'] == 'SF'].sort_values(by='salary', ascending=False)

                  Age Pos    salary  season_end  season_start team
LeBron James     32.0  SF  33285709        2018          2017  CLE
Carmelo Anthony  32.0  SF  26243760        2018          2017  OKC
Kawhi Leonard    25.0  SF  18868625        2018          2017  SAS

In [17]:
players[players['Pos'] == 'PG'].sort_values(by='salary', ascending=False)

                    Age Pos    salary  season_end  season_start team
Stephen Curry      28.0  PG  34682550        2018          2017  GSW
Russell Westbrook  28.0  PG  28530608        2018          2017  OKC

![separator1](https://user-images.githubusercontent.com/7065401/39119545-6d73d9aa-46ec-11e8-98d3-40204614f000.png)

## Aggregation

This is usually referred to as **an aggregation**, you have a set of values (for example, all the salaries of the players in position `PG`) and you want to "aggregate" them or "reduce" them to a single value that has meaning for you. In this case, the aggregation is the `max` function. For each _group of players_ (split by position), we want to get the `max` salary:

In [21]:
players['salary'].groupby(players['Pos']).max()

Pos
PF    31269231
PG    34682550
SF    33285709
SG    17826150
Name: salary, dtype: int64

The `max` function in this case, is the applied function, we could apply any other different function, for example, `mean` to get the average salary per position:

In [14]:
players['salary'].groupby(players['Pos']).mean()

Pos
PF    2.859404e+07
PG    3.160658e+07
SF    2.613270e+07
SG    1.016308e+07
Name: salary, dtype: float64

We could verify it works manually:

In [15]:
players[players['Pos'] == 'PG'].sort_values(by='salary', ascending=False)

                    Age Pos    salary  season_end  season_start team
Stephen Curry      28.0  PG  34682550        2018          2017  GSW
Russell Westbrook  28.0  PG  28530608        2018          2017  OKC

In [16]:
players.loc[players['Pos'] == 'PG', 'salary'].mean()

31606579.0

The result of the `groupby` operation is a `Series`, indexed by the group and containing the aggregation result as the values. What happens if you want to group by multiple parameters?

In [17]:
players['salary'].groupby([players['team'], players['Pos']]).max()

team  Pos
CLE   SF     33285709
DEN   PF     31269231
GSW   PF     25000000
      PG     34682550
      SG     17826150
LAC   PF     29512900
OKC   PG     28530608
      SF     26243760
SAS   SF     18868625
      SG      2500000
Name: salary, dtype: int64

The result is also a `Series`, but with a hierarchical index.

In the case of grouping by multiple features, **order matters**. Changing the order of the keys to use to group will alter the resulting Series:

In [18]:
players['salary'].groupby([players['Pos'], players['team']]).max()

Pos  team
PF   DEN     31269231
     GSW     25000000
     LAC     29512900
PG   GSW     34682550
     OKC     28530608
SF   CLE     33285709
     OKC     26243760
     SAS     18868625
SG   GSW     17826150
     SAS      2500000
Name: salary, dtype: int64

Although the values will need to match in the common keys. For example, the max salary of "Team `GSW`, position `PF`" is the same as max salary of "position `PF`, team `GSW`".

![separator1](https://user-images.githubusercontent.com/7065401/39119545-6d73d9aa-46ec-11e8-98d3-40204614f000.png)

### Custom aggregations

Most common aggregation functions are already provided (`min`, `max`, `mean`, etc.). But you can also use other custom functions with the `aggregate` method:

In [19]:
players.groupby([players['team']]).aggregate(np.sum)

       Age    salary  season_end  season_start
team
CLE   32.0  33285709        2018          2017
DEN   31.0  31269231        2018          2017
GSW   82.0  77508700        6054          6051
LAC   27.0  29512900        2018          2017
OKC   60.0  54774368        4036          4034
SAS   64.0  21368625        4036          4034

As you can see, `aggregate` is running the function in every column, even in those that don't make sense (like `season_end` or `season_start`). We can, of course, select the columns to use beforehand:

In [20]:
players[['salary', 'Age']].groupby([players['team']]).aggregate(np.max)

        salary   Age
team
CLE   33285709  32.0
DEN   31269231  31.0
GSW   34682550  28.0
LAC   29512900  27.0
OKC   28530608  32.0
SAS   18868625  39.0

Or...

In [21]:
players.groupby([players['team']])[['salary', 'Age']].aggregate(np.max)

        salary   Age
team
CLE   33285709  32.0
DEN   31269231  31.0
GSW   34682550  28.0
LAC   29512900  27.0
OKC   28530608  32.0
SAS   18868625  39.0

**`aggregate` and multiple parameters:**

Grouping by multiple parameters also works with `aggregate`:

In [22]:
players[['salary', 'Age']].groupby([players['team'], players['Pos']]).aggregate(np.max)

            salary   Age
team Pos
CLE  SF   33285709  32.0
DEN  PF   31269231  31.0
GSW  PF   25000000  28.0
     PG   34682550  28.0
     SG   17826150  26.0
LAC  PF   29512900  27.0
OKC  PG   28530608  28.0
     SF   26243760  32.0
SAS  SF   18868625  25.0
     SG    2500000  39.0

**Multiple functions:**

`aggregate` can also take multiple functions to apply to the groups:

In [23]:
def range_max_min(values):
    return values.max() - values.min()

In [24]:
players[['salary', 'Age']].groupby([players['team']]).aggregate([np.max, np.min, range_max_min])

        salary                           Age
          amax      amin range_max_min  amax  amin range_max_min
team
CLE   33285709  33285709             0  32.0  32.0           0.0
DEN   31269231  31269231             0  31.0  31.0           0.0
GSW   34682550  17826150      16856400  28.0  26.0           2.0
LAC   29512900  29512900             0  27.0  27.0           0.0
OKC   28530608  26243760       2286848  32.0  28.0           4.0
SAS   18868625   2500000      16368625  39.0  25.0          14.0

**Dict of operations**

You can also pass to `aggregate` a dictionary containing different operations to perform, based on the column:

In [25]:
players[['salary', 'Age']].groupby([players['team']]).aggregate({
    'salary': np.max,
    'Age': np.mean
})

        salary        Age
team
CLE   33285709  32.000000
DEN   31269231  31.000000
GSW   34682550  27.333333
LAC   29512900  27.000000
OKC   28530608  30.000000
SAS   18868625  32.000000

![separator1](https://user-images.githubusercontent.com/7065401/39119545-6d73d9aa-46ec-11e8-98d3-40204614f000.png)

### `GroupBy.apply`

`apply` is also a method available to run custom operations on your groups. It's similar to `aggregate`, so we usually recommend the later one over `apply`:

In [26]:
players['salary'].groupby([players['team']]).apply(np.max)

team
CLE    33285709
DEN    31269231
GSW    34682550
LAC    29512900
OKC    28530608
SAS    18868625
Name: salary, dtype: int64

In [27]:
players['salary'].groupby([players['team']]).apply(lambda x: x.max() - x.min())

team
CLE           0
DEN           0
GSW    16856400
LAC           0
OKC     2286848
SAS    16368625
Name: salary, dtype: int64

![separator1](https://user-images.githubusercontent.com/7065401/39119545-6d73d9aa-46ec-11e8-98d3-40204614f000.png)

### More examples using the whole data

Now we'll use the complete dataset and try more grouping and aggregations

In [22]:
df = pd.read_csv('data/nba_2017_cleaned.csv', index_col=1, dtype={
    'Tm': 'category',
    'Pos': 'category'
})

In [23]:
df.head()

,Tm,Rk,Pos,Age,G,GS,MP,FG,FGA,FG%,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
Player,,,,,,,,,,,,,,,,,,,,,
DeAndre' Bembry,ATL,40,SF,22,38,1,371,47,98,0.480,...,0.375,14,45,59,28,8,5,16,21,101
Dennis Schroder,ATL,394,PG,23,79,78,2485,548,1214,0.451,...,0.855,42,206,248,499,74,16,258,149,1414
Dwight Howard,ATL,205,C,31,74,74,2199,388,613,0.633,...,0.533,296,644,940,104,64,92,170,203,1002
Edy Tavares,ATL,418,C,24,1,0,4,1,1,1.000,...,0.000,0,1,1,0,0,0,0,0,2
Gary Neal,ATL,323,SG,32,2,0,18,0,7,0.000,...,1.000,0,1,1,1,0,0,0,1,4

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 486 entries, DeAndre' Bembry to Trey Burke
Data columns (total 29 columns):
Tm      486 non-null category
Rk      486 non-null int64
Pos     486 non-null category
Age     486 non-null int64
G       486 non-null int64
GS      486 non-null int64
MP      486 non-null int64
FG      486 non-null int64
FGA     486 non-null int64
FG%     485 non-null float64
3P      486 non-null int64
3PA     486 non-null int64
3P%     449 non-null float64
2P      486 non-null int64
2PA     486 non-null int64
2P%     483 non-null float64
eFG%    485 non-null float64
FT      486 non-null int64
FTA     486 non-null int64
FT%     470 non-null float64
ORB     486 non-null int64
DRB     486 non-null int64
TRB     486 non-null int64
AST     486 non-null int64
STL     486 non-null int64
BLK     486 non-null int64
TOV     486 non-null int64
PF      486 non-null int64
PTS     486 non-null int64
dtypes: category(2), float64(5), int64(22)
memory usage: 107.7+ KB

In [25]:
df['FG'].groupby(df['Pos']).mean()

Pos
C     196.268041
PF    163.116505
PG    204.577320
SF    203.595238
SG    192.523810
Name: FG, dtype: float64

In [26]:
df.groupby('Pos').mean()

,Rk,Age,G,GS,MP,FG,FGA,FG%,3P,3PA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
Pos,,,,,,,,,,,,,,,,,,,,,
C,263.391753,26.257732,52.855670,25.567010,1110.175258,196.268041,370.989691,0.528753,14.886598,42.164948,...,0.666695,100.144330,232.793814,332.938144,67.824742,30.257732,47.298969,62.659794,118.113402,495.247423
PF,237.368932,26.029126,48.194175,21.378641,1036.718447,163.116505,352.990291,0.443155,34.786408,101.223301,...,0.710949,58.077670,173.563107,231.640777,67.728155,29.058252,24.456311,50.864078,91.300971,427.291262
PG,253.659794,26.731959,50.876289,24.804124,1207.639175,204.577320,470.309278,0.411289,57.113402,159.010309,...,0.783926,23.814433,121.268041,145.082474,219.298969,45.154639,10.474227,91.257732,88.835052,577.628866
SF,222.702381,26.976190,55.547619,29.654762,1345.821429,203.595238,456.095238,0.418048,58.166667,166.202381,...,0.760575,43.488095,176.059524,219.547619,98.404762,47.297619,21.750000,61.857143,101.738095,563.035714
SG,238.390476,26.152381,51.809524,23.257143,1230.266667,192.523810,447.828571,0.395779,69.628571,189.380952,...,0.779755,24.028571,117.123810,141.152381,104.657143,38.780952,12.533333,61.257143,86.904762,533.161905

In [27]:
df['FG'].groupby(df['Pos']).size()

Pos
C      97
PF    103
PG     97
SF     84
SG    105
Name: FG, dtype: int64

In [28]:
df.groupby('Pos').size()

Pos
C      97
PF    103
PG     97
SF     84
SG    105
dtype: int64

We can also pass custom functions:

In [29]:
df['FG'].groupby(df['Pos']).apply(np.mean)

Pos
C     196.268041
PF    163.116505
PG    204.577320
SF    203.595238
SG    192.523810
Name: FG, dtype: float64

![separator2](https://user-images.githubusercontent.com/7065401/39119518-59fa51ce-46ec-11e8-8503-5f8136558f2b.png)